#include <stdio.h>

int main ( void )
{
	char a[10][10] = {
		{"",Å†,Å†,Å°,Å°,Å†,Å°,Å†,Å†,Å°},
		{Å°,Å†,Å†,Å°,Å°,Å†,Å°,Å†,Å†,Å°},
		{Å°,Å†,Å†,Å°,Å°,Å†,Å°,Å†,Å†,Å°},
		{Å°,Å†,Å†,Å°,Å°,Å†,Å°,Å†,Å†,Å°},
		{Å°,Å†,Å†,Å°,Å°,Å†,Å°,Å†,Å†,Å°},
		{Å°,Å†,Å†,Å°,Å°,Å†,Å°,Å†,Å†,Å°},
		{Å°,Å†,Å†,Å°,Å°,Å†,Å°,Å†,Å†,Å°},
		{Å°,Å†,Å†,Å°,Å°,Å†,Å°,Å†,Å†,Å°},
		{Å°,Å†,Å†,Å°,Å°,Å†,Å°,Å†,Å†,Å°},
		{Å°,Å†,Å†,Å°,Å°,Å†,Å°,Å†,Å†,Å°}
	};

	int i,j;

	for(i=0; i<10; i++){
		for(j=0; j<10, j++){
			printf("%c",a[i][j]);
		}
		printf("\n");
	}

	return 0;
}