study_data_S2/Rails/Rails-test/sample_app/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at", "password_digest") VALUES ('藤原', 'shu113104go@docomo.ne.jp', NULL, '2025-07-21 15:34:16.880296', '2025-07-21 15:34:16.880296', '$2a$12$MFMpmUAvdvAtJoqD76H0MOYhL2nt/ovkYv2OLpNkTgEUMdW7cBEw6') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
    def set_user
      @user = User.find(params.expect(:id))